Revit 2024 API
ParameterTypeId.EnergyAnalysisAdvancedOptions Property
 "Other Options"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId EnergyAnalysisAdvancedOptions { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisAdvancedOptions As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisAdvancedOptions {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace